Revit 2024 API
HorizontalCurveEndpoint.NextCurveType Property
 The HorizontalCurveType of the curve which connects the endpoint to the next displayed curve. If this endpoint's Station equals DisplayedEndStation, returns Unknown curve type.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public HorizontalCurveType NextCurveType { get; internal set; }
Visual Basic
Public Property NextCurveType As HorizontalCurveType
	Get
	Friend Set
Visual C++
public:
property HorizontalCurveType NextCurveType {
	HorizontalCurveType get ();
	internal: void set (HorizontalCurveType value);
}
See Also
HorizontalCurveEndpoint Class
Autodesk.Revit.DB.Infrastructure Namespace